import type { ScheduleData } from '../types/schedule'

export const scheduleData: ScheduleData = {
  'شنبه': [
    {
      name: 'برنامه‌سازی پیشرفته',
      start: '10:00',
      end: '11:30',
      place: 'مجتمع الهیه • سایت ۶ • کلاس ۳۲۲',
      code: '۵۹۹۱۱۱۶۷',
      color: 'c-purple'
    },
    {
      name: 'برنامه‌نویسی مبتنی بر وب',
      start: '12:15',
      end: '15:00',
      place: 'مجتمع الهیه • سایت ۷ • کلاس ۳۲۳',
      code: '۵۹۹۱۱۶۷۵',
      color: 'c-blue'
    }
  ],

  'یکشنبه': [
    {
      name: 'پایگاه‌داده‌ها',
      start: '11:30',
      end: '13:00',
      place: 'مجتمع الهیه • سایت ۱۱۱ • کلاس ۳۲۹',
      code: '۵۹۹۱۱۴۰۱',
      color: 'c-green'
    }
  ],

  'دوشنبه': [
    {
      name: 'تجزیه و تحلیل سیستم‌ها',
      start: '17:00',
      end: '19:00',
      place: 'مجتمع الهیه • سایت ۱۱۱ • کلاس ۳۳۰',
      code: '۵۹۹۱۱۹۸۸',
      color: 'c-orange'
    }
  ],

  'سه‌شنبه': [
    {
      name: 'مبانی ساختمان گسسته',
      start: '10:00',
      end: '11:30',
      place: 'مجتمع الهیه • سایت ۱۱۱ • کلاس ۳۳۰',
      code: '۵۹۹۱۱۲۶۷',
      color: 'c-green'
    },
    {
      name: 'نرم‌افزارهای توسعه موبایل',
      start: '11:30',
      end: '13:00',
      place: 'مجتمع الهیه • سایت ۲ • کلاس ۳۱۷',
      code: '۵۹۹۱۱۲۵۸',
      color: 'c-pink'
    },
    {
      name: 'امنیت شبکه',
      start: '13:00',
      end: '15:00',
      place: 'مجتمع الهیه • سایت ۱۱۱ • کلاس ۳۲۹',
      code: '۵۹۹۱۱۸۱۹',
      color: 'c-red'
    },
    {
      name: 'مدار منطقی',
      start: '15:00',
      end: '17:00',
      place: 'مجتمع الهیه • سایت ۱۱۱ • کلاس ۳۳۰',
      code: '۵۹۹۱۱۴۷۷',
      color: 'c-cyan'
    }
  ],

  'چهارشنبه': [
    {
      name: 'آزمایشگاه نرم‌افزارهای گرافیکی',
      start: '08:00',
      end: '10:00',
      place: 'مجتمع الهیه • سایت ۷ • کلاس ۳۲۳',
      code: '۵۹۹۱۱۱۶۳',
      color: 'c-violet'
    }
  ]
}
